"use strict"

// let value = true;
// alert(typeof value);
// // булевое значение. будет ложь, тк строка алерта пуста

// value = String(value);
// alert(typeof value);
// // строковое преобразование пустоты(заведомо лжи) в строку

// alert("6" / "2");
// // преобразование строк в  числа математическим действием

// let str = "123";
// alert(typeof str); // string
// let num = Number(str); // становится числом 123
// alert(typeof num);

// let age = Number("Любая строка вместо числа");
// alert(age); // NaN, преобразование не удалось

// alert(Boolean(1)); // true
// alert(Boolean(0)); // false
// alert(Boolean("Привет!")); // true
// alert(Boolean("")); // false

// let x = 1;
// x = -x;
// alert(x); // -1, применили унарный минус,а если 2 операнда, то бинарный

// alert(Math.random());
// // возвращает случайное число в диапазоне от 0 (включительно) до 1 (но не включая 1)

// alert(Math.max(3, 8, -13, 0, 10));
// // возвращает максимальное число из перечисленных аргуметов функции

// alert(Math.min(1, 2, -9));
// // возвращает минимальное число из перечисленных аргуметов функции


// let a = '100px';
// let b = '323px';
// let result = parseInt(a) + parseInt(b);
// console.log(result);

// console.log(Math.max(10, -45, 102, 36, 12, 0, -1));


// let c = 123.3399;
// console.log(Math.round(c));

// let d = 0.111; // Округлить до 1
// console.log(Math.ceil(d))
// let e = 45.333333; // Округлить до 45.3
// console.log(e.toFixed(1))
// let f = 3; // Возвести в степень 5 (должно быть 243)
// console.log(f ** 5)
// let g = 400000000000000; // Записать в сокращенном виде
// console.log(g = 4e14)
// let h = -'1' != 1;
// alert(h)



// let f = 3; // Возвести в степень 5 (должно быть 243)
// let g = 400000000000000; // Записать в сокращенном виде
// let h = '1' != 1; // Поправить условие, чтобы результат
// был true(значения изменять нельзя, только оператор)
